{
  "jobs": [{
    "company_name": "Leverage New Age Media",
    "description": "*First, most importantly, you can [apply on our site](https://leveragenewagemedia.com/work-for-leverage/ \"apply on our site\").*\r\n\r\nLeverage is looking for creative, technical, and strategic thinkers that want to work in a laid-back, fun environment while doing what they love.  All in all, we just try to create cool stuff for our clients.\r\n\r\n###A day in the life...\r\n- Custom website development (responsive, of course) - a designer will give you a concept and you get to make it work\r\n- We often use Wordpress as a CMS when needed\r\n- iOS, Android, and PWA development\r\n- You might build a chatbot or custom Slack integration\r\n- Personalization techniques — how can an app or website be personalized in both functionality and content for each visitor.\r\n- Lots of form development and data management\r\n- Lots of API integrations with all sorts of services like Twitter, Facebook, Instagram, Slack, Campaign Monitor, Stripe, etc.\r\n- Constantly looking for ways to make things cooler, smarter, work better, or work differently.\r\n- .NET and MSSQL (IIS environment) website development and maintenance for some of our corporate clients\r\n- LAMP web projects for both internal and client-facing applications like a \"Service Management System\" for a construction client, or a \"client gateway\" for internal project management\r\n- Web projects that leverage modern technologies like Angular and React\r\n- Database design, development, and maintenance\r\n- Server setup and maintenance\r\n\r\n###Requirements / Skills...\r\n- Computer Science degree or equivalent experience\r\n- You should be able to do HTML , CSS ( SASS ), and JavaScript (jQuery) with your eyes closed and one hand tied behind your back.\r\n- Proficient with the LAMP Stack\r\n- A solid working knowledge of Photoshop will be critical for success in this role for converting concepts into code.\r\n- Proficient in responsive design and development best practices is a must.\r\n- Proficient in Git version control\r\n- HTML email development knowledge would also be great.\r\n- Highly organized, detail-oriented, and motivated\r\n- Curious to constantly expand knowledge and skillset\r\n\r\n###Preferred Skills...\r\n- Angular.js\r\n- React.js\r\n- Node.js\r\n- JSON\r\n- Mobile Development (iOS, Android, Hybrid, etc.)\r\n- PHP\r\n- Java\r\n- Python\r\n- Ruby\r\n- Server management (Apache / IIS)\r\n- Database management (MySQL, MSSQL, etc.)\r\n- .NET systems\r\n- C#\r\n- Working knowledge of CMS and eCommerce solutions will be important as well - Wordpress , Shopify , Stripe , Umbraco , Magento , etc.\r\n\r\n###Compensation...\r\nCompensation is negotiable.  Depending on experience and skill set, pay may range from **$40,000 - $80,000**\r\n\r\n##Apply\r\nCheck out our site where you can let us know all the cool stuff you can do and send us your r&eacute;sum&eacute;.  We look forward to hearing from you!\r\n[leveragenewagemedia.com/work-for-leverage](https://leveragenewagemedia.com/work-for-leverage/ \"leveragenewagemedia.com/work-for-leverage\")\r\n",
    "featured": true,
    "featured_text": "Work with a fun group of people while building awesome stuff!",
    "remote": false,
    "term": "Full Time",
    "title": "Front End Developer",
    "url": "http://codepen.io/url/job/ZyLaxz",
    "hashid": "NEDwZA",
    "address": {
      "address1": "205 Chesterfield Ind Blvd",
      "address2": null,
      "city": "St. Louis",
      "state_prov": "MO",
      "postal_code": "63005",
      "country": "US"
    }
  }, {
    "company_name": "Agile Pixel",
    "description": "Agile Pixel, a busy web development agency with international clients, is looking to hire a full-time talented frontend developer to help us build beautiful, interactive websites and applications, giving our client an engaging web experiences.\r\n\r\n##About Us:##\r\nWe’re a team of four developers in the UK and US. Our clients include local florists, well-known musicians, international charities and online gaming companies. We build a wide range of websites from simple CMS sites to complex web applications. We’ve got a tonne of work to do and we’re ready to grow our team. Our stack includes PHP, MySQL, Javascript, SCSS, WordPress, Craft CMS, ExpressionEngine, Laravel, Magento, Shopify and more.\r\n\r\n##Role Responsibilities:##\r\n- Understand and help us improve our processes\r\n- Write clean, well-designed code\r\n- Produce detailed specifications and checklists\r\n- Troubleshoot, test and maintain the core product software\r\n- Understand data structure concepts to ensure strong optimization and functionality\r\n- Contribute in all phases of the development lifecycle\r\n- Develop and deploy new features to facilitate related procedures and tools\r\n\r\n##Compensation and Benefits:##\r\n- £25,000 per annum\r\n- 28 days’ paid annual leave\r\n- Work from home or work from shared office space\r\n\r\n##About You:##\r\nYou’re excited to tackle problems and willing to ask questions. You write clean code and want to make the web a better place. You’re looking to build real-world experience and develop your coding skills at a company where you can learn and grow. You’ll share your opinion and learn from the team. You are located within 2 time zones of the UK (GMT+/-2 hours).\r\n\r\n###You absolutely have these skills:###\r\n- Expert knowledge of HTML5, CSS, SCSS, Javascript, and W3C compliance\r\n- Working knowledge of WordPress, PHP and MySQL\r\n- Knowledge of advanced CSS using a preprocessor (we use SCSS & Gulp)\r\n- Knowledge of what makes a great user experience and empathy that there's a person on the other side of the screen using what we build\r\n- Personable, friendly and amenable approach\r\n- Enjoy talking to other humans\r\n- Desire and willingness to take initiative\r\n- Self-directed and capable of working in a fast-paced environment\r\n- Comfortable working on multiple projects and deadlines at once\r\n- Ability to receive and provide constructive feedback positively\r\n- Passion for best design and coding practices\r\n- Write valid and well structured code across all languages you know\r\n- Understanding of cross-browser / platform compatibility issues\r\n- Experience integrating server-side code to produce dynamic pages\r\n- Passionate about emerging web technologies\r\n- Previous experience working on integrated projects with design and marketing teams\r\n- Ability to convey digital solutions to various internal and external audiences\r\n- Experience working with Git version control\r\n\r\n###You might have these skills:###\r\n- Knowledge of HTML email design and build\r\n- Experience integrating third-party APIs\r\n- Experienced in AJAX techniques\r\n- Experience working with with ExpressionEngine, Craft, Magento, Prestashop and Shopify\r\n- Experience in digital marketing\r\n- Experience in automated testing and continuous integration\r\n- Good understanding of accessibility\r\n- Experience working in a client facing role\r\n\r\n##Next Steps:##\r\nContact us by sending a well-written email to [hello@agilepixel.io](mailto:hello@agilepixel.io). We want to know about you and your work, so samples are very much appreciated. Tell us all about your front-end experience and WordPress experience. If you contributed to a group project, what did you make? How did you learn how to code? What’s your stack? Which of your talents will add the most to our company? Where are you located? What’s your current employment status and when could you start?\r\n\r\nOnce you’ve applied, our team will review your application and send you a few exercises to assess your knowledge and determine if you’ll make it to the interview stage.",
    "featured": false,
    "featured_text": null,
    "remote": true,
    "term": "Full Time",
    "title": "Full-Time Experienced Front End Developer",
    "url": "http://codepen.io/url/job/ZOPRgr",
    "hashid": "gEMebE"
  }, {
    "company_name": "Hart",
    "description": "",
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "Front End Engineer ",
    "url": "http://codepen.io/url/job/zNWRMZ",
    "hashid": "VEnGMk",
    "address": {
      "address1": "1515 E. Orangewood Ave",
      "address2": null,
      "city": "Anaheim",
      "state_prov": "CA",
      "postal_code": "92661",
      "country": "US"
    }
  }, {
    "company_name": "Close.io",
    "description": "### About Us\r\n\r\nAt [Close.io](https://close.io/) we’re building the sales communication platform of the future. We’ve built a next-generation CRM that eliminates manual data entry and helps sales teams close more deals. We are hiring engineers to help us unify the world's sales calls and emails into one beautiful workflow.\r\n\r\nOur app’s front-end is a single-page HTML5/JavaScript web app written with Backbone.js & React, jQuery, RequireJS, Handlebars, QUnit, etc. It’s built entirely on top of our public REST API and targets only modern browsers. Our UI updates in near real-time and is written in LESS/CSS atop Bootstrap.\r\n\r\nWe ❤ open source – using 40+ frontend libraries/plugins with contributions to many of them.\r\n\r\n### About You\r\n\r\nWe're looking for experienced full-time developers to join our core team who have a strong understanding of web technologies and want to help design, implement, and launch major user-facing features.\r\n\r\n### You Should...\r\n\r\n- have 5+ years experience building modern front-end applications in JavaScript, HTML5, and CSS\r\n- have great product sense and be able to think through user experience issues before diving into the code\r\n- write maintainable, testable, and performant JavaScript\r\n- have a love for great UI\r\n- enjoy debugging all aspects of the front-end app including memory leaks and quirky CSS across browsers\r\n- have experience implementing real-time (e.g. websockets, polling, etc.) web apps\r\n- have significant experience with REST APIs and thoroughly understand HTTP requests\r\n\r\n### Bonus points if you...\r\n\r\n- have an eye for design and experience with Photoshop, Sketch, or similar\r\n- have contributed open source code (core or plugins) for a popular frontend framework such as React, Backbone, or Angular\r\n\r\n### Why work with us?\r\n\r\n- Work remotely from anywhere in the world! Just be willing to do a bit of traveling twice a year for some face-to-face time with the whole team :)  \r\n- Help build a truly successful SaaS company with a stellar team where you can have a huge impact. \r\n- Above market salary and benefits\r\n- Fun company culture that embraces a healthy work/life balance \r\n\r\n---\r\n\r\n<a href=\"https://jobs.lever.co/close.io/10a1e32b-1a59-48dc-b8f4-e6f0dfae4e20/apply?lever-source=cp\">Apply Here</a>\r\n\r\n",
    "featured": false,
    "featured_text": null,
    "remote": true,
    "term": "Full Time",
    "title": "Senior JavaScript/UI Frontend Engineer",
    "url": "http://codepen.io/url/job/ZQbKmr",
    "hashid": "mArGLE"
  }, {
    "company_name": "Simalam",
    "description": "**Sih-mah-lamb?** <br />\r\nSmall and mighty; award-winning; London-based; Simalam works with non-profits and the public sector to create digital tools that create meaningful impact on a local, regional and national scale. We are an intense and passionate team pushing industry boundaries in UX and development.\r\n \r\nWe are looking for someone whose work ethic, curiousity and skill is unparalleled. You strive to understand the \"bigger picture\" while still paying attention to the details that make a great project incredible.<br /><br />\r\n \r\n**The work:**<br />\r\nYou will be working with our cross-disciplinary team to code approved designs. You understand how to use hooks and filters to customize functionality, following WordPress best practices. Your work accurately represents design assets across multiple browsers and devices and you feel comfortable making design decisions based on project style guides. Details are important to you and you are comfortable testing your own work.\r\n\r\nYour contribution to our team isn't limited to your exceptional coding skills. You will contribute to the team's growth and participate in strategic meetings. You're comfortable with being mentored and mentoring.\r\n\r\n- Responsive, cross-browser & W3C compliant HTML, CSS\r\n- Experience with Javascript frameworks\r\n- Codex-approved WordPress theming\r\n- Working with, and implementing, design and style guidelines\r\n- Contributing to team strategy meetings\r\n- Implementing advancements for existing clients\r\n- Ability to QA your own work\r\n<br /><br />\r\n**Education / Experience Requirements:**<br />\r\nAt least 5 years in an agency or corporate environment; with a focus on enterprise-level websites and mobile apps.\r\n<br /><br />\r\n\r\n**We're looking for a person that:**<br />\r\n<ul>\r\n<li>Pays attention to the subtle details that make a great user experience</li>\r\n<li>Is comfortable working on multiple projects with simultaneous deadlines</li>\r\n<li>Demonstrated ability to research + solve problems</li>\r\n<li>Keeps up with the latest tools and has a firm understanding of when to use them</li>\r\n<li>Has experience with custom WordPress theme development</li>\r\n<li>Has advanced knowledge of W3C compliance</li>\r\n<li>Has advanced knowledge in creating accessible websites, apps and products</li>\r\n<li>Understands and empathizes that there's a person on the other side of the screen using what we build</li>\r\n<li>Has experience integrating third-party APIs</li>\r\n<li>Has experience with SCSS & Git versioning</li>\r\n</ul>\r\n\r\n<br /><br />\r\n**Why become a Simalonian?**<br />\r\n_Location & schedule independent_ - We have two rules in the office - don't miss meetings and always meet deadlines.\r\n\r\n_You pick your benefits_ - Health, dental, workshops, courses, conferences, books, tech, fitness - we supply you with a budget that you can use how you see fit. \r\n\r\n_Autonomy & project ownership_ - You're excited about finding a solution to each problem and share ideas with the team while always striving to make the job at hand as efficient as possible. \r\n\r\n_Community giving_ - Have a cause or an idea you're passionate about? We have a significant percentage of revenue dedicated to Community Impact. Let's talk about how we're going to make the world a better place.\r\n\r\n_Unlimited vacation time_\r\n\r\n_Coaching & mentoring_ - We push ourselves to always improve. As a team, we help one another grow.\r\n\r\n_Profit sharing_ - We recognize that our dedication is what makes Simalam successful and share a portion of our net profit with the team.\r\n\r\n_A quirky, collaborative environment to grow and thrive in!_\r\n<br /><br /> \r\n\r\n\r\n**The Hiring Process:**<br />\r\nI read through your application and our team looks through the samples you've sent. If you've missed anything, the application is deleted. If your work meets our criteria, we ask you to complete a practicum. After you've completed the practicum to spec and within the deadline you specify, we review your work and rank it against other applications. If you're in the top three, we'll schedule a phone/video/in-person interview. If that works out, we'll offer you probationary position (after all the best way to know if we work well together is, well... to work together). After the probationary period (6-12 weeks), if everything is working out great, then you'll be offered a full time contract.\r\n<br /><br />\r\n\r\n\r\n**How to become a Simalonian:**<br />\r\n[Send us a well-written email](mailto:adam@simalam.com, mike@simalam.com \"email\") introducing yourself. Include all of the following:\r\n<ul>\r\n<li>Are you a Londoner? If not, where you're located;</li>\r\n<li>Your front-end experience;</li>\r\n<li>WordPress experience;</li>\r\n<li>If you're not a Londoner, your remote working experience;</li>\r\n<li>Why you want to work with our team;</li>\r\n<li>If you're currently employed or freelancing;</li>\r\n<li>Your philosophy on continuous improvement;</li>\r\n<li>Your github/codepen/Bitbucket and a detailed walkthrough of ONE of your projects  a live site with a detailed written walk through;</li>\r\n<li>Another 4-6 links of your LIVE work, in point form, BRIEFLY detailing your contribution;</li>\r\n</ul>",
    "featured": false,
    "featured_text": null,
    "remote": true,
    "term": "Full Time",
    "title": "Experienced Front-end Developer",
    "url": "http://codepen.io/url/job/njeAxr",
    "hashid": "QkZMYE"
  }, {
    "company_name": "AltspaceVR",
    "description": "We need design-minded front end developers with deep knowledge of modern web development to create next generation user interfaces. We are leveraging a Chromium integration paired with powerful VR APIs to present web apps in holographic 3D to devices like the Oculus Rift and HTC Vive. Forget supporting IE. With us you'd be programming against HUDs, non-rectangular displays, and holographic projectors.  \r\n\r\n[See more about AltspaceVR](https://www.youtube.com/watch?v=CQtQGoMRXaI) \r\n\r\nWe are:  \r\n\r\n- A virtual reality software company [https://twitter.com/AltspaceVR](https://twitter.com/AltspaceVR)  \r\n- Backed by some of the best investors on the planet [http://altvr.com/about/](http://altvr.com/about/)  \r\n- A team that is passionate about the future of VR  [http://altvr.com/team/](http://altvr.com/team/)  \r\n\r\n**[Apply!](https://jobs.lever.co/altspace/9761fb55-6bf5-4d49-852d-6ad9b09154eb)**",
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "Virtual Reality Front End UI Engineer",
    "url": "http://codepen.io/url/job/rWbGAZ",
    "hashid": "JzoxrA",
    "address": {
      "address1": "850 Veterans Blvd #305",
      "address2": null,
      "city": "Redwood City",
      "state_prov": "California",
      "postal_code": "94063",
      "country": "US"
    }
  }, {
    "company_name": "Kiddom Inc",
    "description": "",
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "CSS Artist, FE Engineer @ K12 Ed Tech Startup",
    "url": "http://codepen.io/url/job/nbdwYZ",
    "hashid": "QEZMQA",
    "address": {
      "address1": "1067 market st\r\n#2001",
      "address2": null,
      "city": "San Francisco",
      "state_prov": "CA",
      "postal_code": "94103",
      "country": "US"
    }
  }, {
    "company_name": "APT –  design/development/3D/motion",
    "description": null,
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "💻 Creative Front-End Developer 📱",
    "url": "http://codepen.io/url/job/ZPYGmr",
    "hashid": "vzyDrk",
    "address": {
      "address1": "Ovre slottsgate 8",
      "address2": null,
      "city": "OSLO",
      "state_prov": "",
      "postal_code": "0157",
      "country": "NO"
    }
  }, {
    "company_name": "Bytion",
    "description": "",
    "featured": false,
    "featured_text": null,
    "remote": true,
    "term": "Full Time",
    "title": "Front-End Web Developer",
    "url": "http://codepen.io/url/job/ZBNLdZ",
    "hashid": "jzWOqz"
  }, {
    "company_name": "Single Grain",
    "description": "We're looking for a WordPress developer to help with contract/project work on the two properties we have: [Growth Everywhere](http://growtheverywhere.com) and [Single Grain](http://singlegrain.com). \r\n\r\nGrowth Everywhere is an entrepreneurial podcast/interview series where I talk to world-class entrepreneurs and dissect their marketing funnels and also talk about personal growth.\r\n\r\nSingle Grain is a digital marketing agency that has worked with awesome companies.\r\n\r\nResponsibilities include, but are not limited to:\r\n\r\n- Adjusting forms\r\n- Moving things around on pages\r\n- Running A/B tests\r\n- Coding up landing pages/redesigns\r\n- Ensuring our site is as fast as possible\r\n- SEO changes\r\n- Google AMP and Facebook Instant Articles\r\n- Creating/implementing simple widgets\r\n- Working with/managing designers\r\n\r\nThere will be more advanced work in the future. We have our hands in a lot of cookie jars.\r\n\r\nAs long as you're pleasant to work with, fast to respond and a curious person, you'd be the right fit!\r\n\r\nIf you're interested, please make sure you send an e-mail with the subject line 'developers are cool' and include links to examples of your work, your LinkedIn, your site and anything else that's relevant.\r\n\r\n[E-mail me to apply](mailto:eric@singlegrain.com)",
    "featured": true,
    "featured_text": "Work on multiple cool marketing/tech projects at once!",
    "remote": true,
    "term": "Freelance",
    "title": "WordPress Developer [Marketing]",
    "url": "http://codepen.io/url/job/nwwDEn",
    "hashid": "JEjGNk"
  }, {
    "company_name": "EF Education First",
    "description": "",
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "UI Web Developer",
    "url": "http://codepen.io/url/job/npjekZ",
    "hashid": "QzQZrA",
    "address": {
      "address1": "2 Education Circle",
      "address2": null,
      "city": "Cambridge",
      "state_prov": "MA",
      "postal_code": "02141",
      "country": "US"
    }
  }, {
    "company_name": "Overpass",
    "description": "**Job Description:**\r\n\r\nWe are looking to hire in-house software engineers that have exceptional JavaScript skills. The ideal candidate has working experience with modular Javascript, can write pure JS code without depending on third-party libraries and is up to date with the latest JS advancements, e.g. ES6, Background Workers, Web Sockets, etc.\r\n\r\nAt [Overpass](http://www.overpass.com \"Overpass\"), you'll be part of an amazing development team, focused on building a quality product. We are building a communications platform from the ground up. If you want to be challenged, work on the latest technologies and have a great time doing it, this is the place for you.\r\n\r\n**Skills & Requirements:**\r\n\r\n●\tMinimum 6 years working experience with complex JavaScript codebases\r\n\r\n●\tWorking experience with NodeJS\r\n\r\n●\tExperience with Aurelia is a strong plus\r\n\r\n●\tExposure to build & process tools like Grunt, Gulp, Node, NPM, etc.\r\n\r\n●\tStrong understanding of database development\r\n\r\n●\tExposure to NoSQL databases is a plus, particularly Couchbase\r\n\r\n●\tAbility to create clean, sharp and responsive layouts from designs with HTML5, CSS3 and JavaScript is a strong plus\r\n\t\r\n\r\n**Bonus Skills:**\r\n\r\n●\tExperience with VOIP technologies\r\n\r\n●\tExperience with WebRTC\r\n\r\n**Considerations:**\r\n\r\n●\tOur culture and environment promotes personal and professional growth\r\n\r\n●\tWork on the latest technologies, think Big Data, Machine Learning, etc.\r\n\r\n●\tYou'll work in a newly renovated and designed office space.\r\n\r\n**About Us:**\r\n\r\n[Overpass](http://www.overpass.com \"Overpass\") enables organizations to create and supervise campaigns for customer outreach. Companies can invite agents and start making calls in minutes. Right now our platform is in private beta and is being used and tested by a select group of customers.\r\nOur team consists of successful developers, designers, and product people all working towards the same goal, enhance the way companies approach their communications. We’re fortunate to have a team that has a wealth of experience in both business and consumer based products. We know what it takes to truly make a difference in this space and we’re getting ready to show it to the world. We value work-life balance, career growth, and being at the forefront of technology, design and business. Each team member is unique and brings their own contributions to the table. \r\nWe're looking forward to our public beta launch and having you on the team with us.\r\n\r\n**Here are a couple things to consider:**\r\n\r\n●\tWe offer a competitive salary\r\n\r\n●\tYou'll work in a newly renovated and designed office space\r\n\r\n●\tOur kitchen is stocked with lots of free snacks and food\r\n\r\n●\tLounge area\r\n\r\n●\tCasual & relaxed work environment\r\n\r\n●\tFlexible vacation days\r\n\r\n●\tWe are a 5-minute walk from Newark Penn Station and a 25-minute commute from mid & lower Manhattan\r\n\r\n●\tWe give you access to Pluralsight and other resources\r\n\r\n●\tYou will be working with the latest technologies\r\n\r\n●\tWe'll provide you with awesome hardware\r\n\r\n**Job Type:** Full-time\r\n\r\n**THIS IS NOT A REMOTE OPPORTUNITY – LOCAL CANDIDATES ONLY**\r\n\r\nTO APPLY, VISIT US AT [http://www.overpass.com/careers.html](http://www.overpass.com/careers.html \"Careers\") or email your resume to careers@overpass.com",
    "featured": false,
    "featured_text": null,
    "remote": false,
    "term": "Full Time",
    "title": "Senior Javascript Developer",
    "url": "http://codepen.io/url/job/ZKpgXr",
    "hashid": "jAWeqk",
    "address": {
      "address1": "40 Commerce St",
      "address2": null,
      "city": "Newark",
      "state_prov": "NJ",
      "postal_code": "07102",
      "country": "US"
    }
  }]
}
